export const colorHash = {
  A: {
    label: "A, 公共管理与公共服务设施用地",
    color: [255, 127, 159, 0.6],
    outline: [110, 110, 110, 255]
  },
  A1: {
    label: "A1, 行政办公用地",
    color: [255, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  A2: {
    label: "A2, 文化设施用地",
    color: [255, 127, 159, 0.6],
    outline: [110, 110, 110, 255]
  },
  A21: {
    label: "A21, 图书展览用地",
    color: [255, 127, 159, 0.6],
    outline: [110, 110, 110, 255]
  },
  A22: {
    label: "A22, 文化活动用地",
    color: [255, 127, 159, 0.6],
    outline: [110, 110, 110, 255]
  },
  A3: {
    label: "A3, 教育科研用地",
    color: [255, 159, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  A31: {
    label: "A31, 高等院校用地",
    color: [255, 159, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  A32: {
    label: "A32, 中等专业学校用地",
    color: [255, 159, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  A33: {
    label: "A33, 中小学用地",
    color: [255, 159, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  A34: {
    label: "A34, 特殊教育用地",
    color: [255, 159, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  A35: {
    label: "A35, 科研用地",
    color: [255, 159, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  A4: {
    label: "A4, 体育用地",
    color: [204, 102, 204, 0.6],
    outline: [110, 110, 110, 255]
  },
  A41: {
    label: "A41, 体育场馆用地",
    color: [204, 102, 204, 0.6],
    outline: [110, 110, 110, 255]
  },
  A5: {
    label: "A5, 医疗卫生用地",
    color: [255, 191, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  A51: {
    label: "A51, 医院用地",
    color: [255, 191, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  A52: {
    label: "A52, 卫生防疫用地",
    color: [255, 191, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  A6: {
    label: "A6, 社会福利用地",
    color: [255, 127, 159, 0.6],
    outline: [110, 110, 110, 255]
  },
  A7: {
    label: "A7, 文物古迹用地",
    color: [165, 0, 124, 0.6],
    outline: [110, 110, 110, 255]
  },
  A9: {
    label: "A9, 宗教用地",
    color: [127, 63, 63, 0.6],
    outline: [110, 110, 110, 255]
  },
  B: {
    label: "B, 商业服务业设施用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B1: {
    label: "B1, 商业用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B11: {
    label: "B11, 零售商业用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B12: {
    label: "B12, 批发市场用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B13: {
    label: "B13, 餐饮用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B14: {
    label: "B14, 旅馆用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B2: {
    label: "B2, 商务用地",
    color: [204, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B21: {
    label: "B21, 金融保险用地",
    color: [204, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B22: {
    label: "B22, 艺术传媒用地",
    color: [204, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B29: {
    label: "B29, 其他商务用地",
    color: [204, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B3: {
    label: "B3, 娱乐康体用地",
    color: [153, 38, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B31: {
    label: "B31, 娱乐用地",
    color: [153, 38, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B32: {
    label: "B32, 康体用地",
    color: [153, 38, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B4: {
    label: "B4, 公用设施营业网点用地",
    color: [204, 102, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B41: {
    label: "B41, 加油加气站用地",
    color: [204, 102, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B49: {
    label: "B49, 其他公用设施营业网点用地",
    color: [204, 102, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  B9: {
    label: "B9, 其他服务设施用地",
    color: [153, 76, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C: {
    label: "C, 公共设施用地",
    color: [255, 0, 63, 0.6],
    outline: [110, 110, 110, 255]
  },
  C1: {
    label: "C1, 行政办公用地",
    color: [255, 127, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C11: {
    label: "C11, 市属办公用地",
    color: [255, 127, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C12: {
    label: "C12, 非市属办公用地",
    color: [255, 127, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C2: {
    label: "C2, 商业金融业用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C21: {
    label: "C21, 贸易咨询用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C22: {
    label: "C22, 金融保险业用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C23: {
    label: "C23, 贸易咨询用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C24: {
    label: "C24, 服务业用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C25: {
    label: "C25, 旅馆业用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C26: {
    label: "C26, 市场用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C3: {
    label: "C3, 文化娱乐用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C32: {
    label: "C32, 文化艺术团体用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C33: {
    label: "C33, 广播电视用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C34: {
    label: "C34, 图书展览用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C35: {
    label: "C35, 影剧院用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C36: {
    label: "C36, 游乐用地",
    color: [255, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  C4: {
    label: "C4, 体育用地",
    color: [204, 0, 102, 0.6],
    outline: [178, 178, 178, 255]
  },
  C41: {
    label: "C41, 体育场馆用地",
    color: [204, 0, 102, 0.6],
    outline: [178, 178, 178, 255]
  },
  C5: {
    label: "C5, 医疗卫生用地",
    color: [0, 204, 102, 0.6],
    outline: [178, 178, 178, 255]
  },
  C51: {
    label: "C51, 医院用地",
    color: [0, 204, 102, 0.6],
    outline: [178, 178, 178, 255]
  },
  C6: {
    label: "C6, 教育科研设计用地",
    color: [255, 127, 191, 0.6],
    outline: [178, 178, 178, 255]
  },
  C61: {
    label: "C61, 高等学校用地",
    color: [255, 127, 191, 0.6],
    outline: [178, 178, 178, 255]
  },
  C63: {
    label: "C63, 成人与业余学校用地",
    color: [255, 127, 191, 0.6],
    outline: [178, 178, 178, 255]
  },
  C65: {
    label: "C65, 科研设计用地",
    color: [255, 127, 191, 0.6],
    outline: [178, 178, 178, 255]
  },
  C7: {
    label: "C7, 文物古迹用地",
    color: [255, 127, 255, 0.6],
    outline: [178, 178, 178, 255]
  },
  C9: {
    label: "C9, 其他公共设施用地",
    color: [204, 102, 127, 0.6],
    outline: [178, 178, 178, 255]
  },
  D: {
    label: "D, 特殊用地",
    color: [153, 114, 0, 0.6],
    outline: [178, 178, 178, 255]
  },
  D1: {
    label: "D1, 军事用地",
    color: [153, 114, 0, 0.6],
    outline: [178, 178, 178, 255]
  },
  D3: {
    label: "D3, 保安用地",
    color: [76, 57, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  E: {
    label: "E, 非建设用地",
    color: [127, 255, 159, 0.6],
    outline: [110, 110, 110, 255]
  },
  E1: {
    label: "E1, 水域",
    color: [0, 255, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  E2: {
    label: "E2, 农林用地",
    color: [153, 204, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  G: {
    label: "G, 绿地",
    color: [0, 153, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  G1: {
    label: "G1, 公园绿地",
    color: [0, 153, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  G11: {
    label: "G11, 公园绿地",
    color: [0, 153, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  G12: {
    label: "G12, 街头绿地",
    color: [0, 153, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  G2: {
    label: "G2, 防护绿地",
    color: [0, 204, 51, 0.6],
    outline: [110, 110, 110, 255]
  },
  G21: {
    label: "G21, 园林生产绿地",
    color: [0, 165, 41, 0.6],
    outline: [110, 110, 110, 255]
  },
  G22: {
    label: "G22, 防护绿地",
    color: [0, 165, 41, 0.6],
    outline: [110, 110, 110, 255]
  },
  G3: {
    label: "G3, 广场用地",
    color: [153, 204, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  H: {
    label: "H, 建设用地",
    color: [255, 255, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  H2: {
    label: "H2, 区域交通设施用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  H21: {
    label: "H21, 铁路用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  H22: {
    label: "H22, 公路用地",
    color: [0, 0, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  H23: {
    label: "H23, 港口用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  H24: {
    label: "H24, 机场用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  H3: {
    label: "H3, 区域公用设施用地",
    color: [204, 51, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  H4: {
    label: "H4, 特殊用地",
    color: [63, 95, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  M: {
    label: "M, 工业用地",
    color: [153, 114, 76, 0.6],
    outline: [110, 110, 110, 255]
  },
  M1: {
    label: "M1, 一类工业用地",
    color: [153, 114, 76, 0.6],
    outline: [110, 110, 110, 255]
  },
  M2: {
    label: "M2, 二类工业用地",
    color: [127, 95, 63, 0.6],
    outline: [110, 110, 110, 255]
  },
  M3: {
    label: "M3, 三类工业用地",
    color: [76, 57, 38, 0.6],
    outline: [110, 110, 110, 255]
  },
  R: {
    label: "R, 居住用地",
    color: [255, 255, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  R1: {
    label: "R1, 一类居住用地",
    color: [255, 255, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  R11: {
    label: "R11, 住宅用地",
    color: [255, 255, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  R2: {
    label: "R2, 居住用地",
    color: [255, 255, 0, 0.6],
    outline: [130, 130, 130, 255]
  },
  R21: {
    label: "R21, 住宅用地",
    color: [255, 255, 0, 0.6],
    outline: [130, 130, 130, 255]
  },
  R22: {
    label: "R22, 服务设施用地",
    color: [255, 255, 0, 0.6],
    outline: [130, 130, 130, 255]
  },
  R23: {
    label: "R23, 道路用地",
    color: [204, 204, 0, 0.6],
    outline: [130, 130, 130, 255]
  },
  R24: {
    label: "R24, 绿地",
    color: [255, 255, 0, 0.6],
    outline: [110, 110, 110, 255]
  },
  S: {
    label: "S, 道路广场用地",
    color: [255, 255, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  S1: {
    label: "S1, 城市道路用地",
    color: [255, 255, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  S19: {
    label: "S19, 其他道路用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  S2: {
    label: "S2, 广场用地",
    color: [0, 95, 127, 0.6],
    outline: [110, 110, 110, 255]
  },
  S22: {
    label: "S22, 游憩集会广场用地",
    color: [91, 91, 91, 0.6],
    outline: [110, 110, 110, 255]
  },
  S3: {
    label: "S3, 社会停车场库用地",
    color: [173, 173, 173, 0.6],
    outline: [110, 110, 110, 255]
  },
  S31: {
    label: "S31, 机动车停车场库用地",
    color: [173, 173, 173, 0.6],
    outline: [110, 110, 110, 255]
  },
  S4: {
    label: "S4, 交通场站用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  S41: {
    label: "S41, 公共交通场站用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  S42: {
    label: "S42, 社会停车场用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  S9: {
    label: "S9, 其他交通设施用地",
    color: [128, 128, 128, 0.6],
    outline: [110, 110, 110, 255]
  },
  T: {
    label: "T, 对外交通用地",
    color: [132, 132, 132, 0.6],
    outline: [110, 110, 110, 255]
  },
  T1: {
    label: "T1, 铁路用地",
    color: [255, 255, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  T2: {
    label: "T2, 公路用地",
    color: [132, 132, 132, 0.6],
    outline: [110, 110, 110, 255]
  },
  T21: {
    label: "T21, 高速公路用地",
    color: [132, 132, 132, 0.6],
    outline: [110, 110, 110, 255]
  },
  T23: {
    label: "T23, 长途客运站用地",
    color: [132, 132, 132, 0.6],
    outline: [110, 110, 110, 255]
  },
  T4: {
    label: "T4, 港口用地",
    color: [132, 132, 132, 0.6],
    outline: [110, 110, 110, 255]
  },
  U: {
    label: "U, 市政公用设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U1: {
    label: "U1, 供应设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U11: {
    label: "U11, 供水用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U12: {
    label: "U12, 供电用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U13: {
    label: "U13, 供燃气用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U14: {
    label: "U14, 供热用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U15: {
    label: "U15, 通信用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U16: {
    label: "U16, 广播电视用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U2: {
    label: "U2, 环境设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U21: {
    label: "U21, 排水用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U22: {
    label: "U22, 货运交通用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U29: {
    label: "U29, 其它交通设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U3: {
    label: "U3, 邮电设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U31: {
    label: "U31, 消防用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U32: {
    label: "U32, 防洪用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U4: {
    label: "U4, 环境卫生设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U41: {
    label: "U41, 雨水、污水处理用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U42: {
    label: "U42, 粪便垃圾处理用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U6: {
    label: "U6, 殡葬设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  U9: {
    label: "U9, 其它市政公用设施用地",
    color: [0, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  W: {
    label: "W, 物流仓储用地",
    color: [191, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  W1: {
    label: "W1, 普通仓库用地",
    color: [191, 0, 255, 0.6],
    outline: [110, 110, 110, 255]
  },
  W2: {
    label: "W2, 危险品仓库用地",
    color: [153, 0, 204, 0.6],
    outline: [110, 110, 110, 255]
  },
  W3: {
    label: "W3, 三类物流仓储用地",
    color: [114, 0, 153, 0.6],
    outline: [110, 110, 110, 255]
  }
};
